{
    "speeches": [
        {
            "speech": "The world must be made safe for democracy. Its peace must be planted upon the tested foundations of political liberty. We have no selfish ends to serve. We desire no conquest, no dominion. We seek no indemnities for ourselves, no material compensation for the sacrifices we shall freely make. We are but one of the champions of the rights of mankind. We shall be satisfied when those rights have been made as secure as the faith and the freedom of nations can make them.",
            "title": "address to Congress",
            "author": "Woodrow Wilson",
            "date": "April 2, 1917"
        },
        {
            "speech": "It may sound incredible, especially to Swiss comrades, but it is nevertheless true that in Russia, also, not only bloody tsarism, not only the capitalists, but also a section of the so-called or ex-Socialists say that Russia is fighting a “war of defence,” that Russia is only fighting against German invasion. The whole world knows, however, that for decades tsarism has been oppressing more than a hundred million people belonging to other nationalities in Russia; that for decades Russia has been pursuing a predatory policy towards China, Persia, Armenia and Galicia. Neither Russia, nor Germany, nor any other Great Power has the right to claim that it is waging a “war of defence”; all the Great Powers are waging an imperialist, capitalist war, a predatory war, a war for the oppression of small and foreign nations, a war for the sake of the profits of the capitalists, who are coining golden profits amounting to billions out of the appalling sufferings of the masses, out of the blood of the proletariat.",
            "title": "International Meeting in Berne",
            "author": "Vladimir Lenin",
            "date": "February 8, 1916"
        },
        {
            "speech": "I am tired of fighting. Our chiefs are killed. Looking Glass is dead. Toohoolhoolzote is dead. The old men are all dead. It is the young men who say, ‘yes’ or ‘no.’ He who led the young men [Olikut] is dead. It is cold, and we have no blankets. The little children are freezing to death. My people, some of them, have run away to the hills, and have no blankets, no food. No one knows where they are — perhaps freezing to death. I want to have time to look for my children and see how many of them I can find. Maybe I shall find them among the dead. Hear me, my chiefs! I am tired. My heart is sick and sad. From where the sun now stands I will fight no more forever.",
            "title": "Surrender speech",
            "author": "Chief Joseph",
            "date": "October 5, 1877"
        },
        {
            "speech": "And so, my fellow Americans: Ask not what your country can do for you — ask what you can do for your country. My fellow citizens of the world: Ask not what America will do for you, but what together we can do for the freedom of man.",
            "title": "inaugural address",
            "author": "John F. Kennedy",
            "date": "January 20, 1961"
        },
        {
            "speech": "When I consider the magnitude of the subject which I am to bring before the House-a subject, in which the interests, not of this country, nor of Europe alone, but of the whole world, and of posterity, are involved: and when I think, at the same time, on the weakness of the advocate who has undertaken this great cause-when these reflections press upon my mind, it is impossible for me not to feel both terrified and concerned at my own inadequacy to such a task. But when I reflect, however, on the encouragement which I have had, through the whole course of a long and laborious examination of this question, and how much candour I have experienced, and how conviction has increased within my own mind, in proportion as I have advanced in my labours;-when I reflect, especially, that however averse any gentleman may now be, yet we shall all be of one opinion in the end;-when I turn myself to these thoughts, I take courage-I determine to forget all my other fears, and I march forward with a firmer step in the full assurance that my cause will bear me out, and that I shall be able to justify upon the clearest principles, every resolution in my hand, the avowed end of which is, the total abolition of the slave trade.",
            "title": "Abolition Speech",
            "author": "William Wilberforce",
            "date": "May 12, 1789"
        }
    ]
}